import Image from "next/image";

import stailessMetal from "../../../../assets/stainlessLists.png";
import Products from "./Products";

const productsItems = [
  {
    No: "1",
    label: "Лист нержавеющий РФ 0,5х1000х1000 12Х18Н10Т М2А-М4А",
    size: "0,5х1000х1000",
    quantity: "0.003655",
  },
  {
    No: "2",
    label: "Лист нержавеющий 0.5х1000х2000 AISI 304 2B матовый ASTM A480/A480M",
    size: "0.5х1000х2000 ",
    quantity: "0.006",
  },
  {
    No: "3",
    label:
      "Лист нержавеющий 0.5х1250х2500 AISI 304 BA+PE зеркало ASTM A480/A480M",
    size: "0.5х1250х2500 ",
    quantity: "3шт.",
  },
  {
    No: "4",
    label: "Лист нержавеющий 0.8х1000х1000 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "0.8х1000х1000",
    quantity: "0.007",
  },
  {
    No: "5",
    label: "Лист нержавеющий 0.8х1250х2350 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "0.8х1250х2350",
    quantity: "0.019",
  },
  {
    No: "6",
    label: "Лист нержавеющий 0.8х1250х2500 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: " 0.8х1250х2500",
    quantity: "3.351",
  },
  {
    No: "7",
    label: "Лист нержавеющий 1,0х1000х1230 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "1,0х1000х1230",
    quantity: "0.0092",
  },
  {
    No: "8",
    label: "Лист нержавеющий 1,0х1000х1300 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "1,0х1000х1300",
    quantity: "0.0118",
  },
  {
    No: "9",
    label: "Лист нержавеющий 1.0х1250х2500 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: " 1.0х1250х2500",
    quantity: "0.049",
  },
  {
    No: "10",
    label: "Лист нержавеющий 1.5х1250х2500 AISI 304 4N+PE шлиф ASTM A480/A480M",
    size: "1.5х1250х2500",
    quantity: "0.147",
  },
  {
    No: "11",
    label: "Лист нержавеющий 1.5х1250х2500 AISI 321 2B матовый ASTM A480/A480M",
    size: "1.5х1250х2500 ",
    quantity: "2.944",
  },
  {
    No: "12",
    label: "Лист нержавеющий 2.0х1000х125 AISI 304 2B матовый ASTM A480/A480M",
    size: "2.0х1000х125",
    quantity: "0.0058",
  },
  {
    No: "13",
    label: "Лист нержавеющий 2.0х1000х625 AISI 304 2B матовый ASTM A480/A480M",
    size: "2.0х1000х625",
    quantity: "0.0098",
  },
  {
    No: "14",
    label: "Лист нержавеющий 2,0х1000х1030 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "2,0х1000х1030",
    quantity: "0.0177",
  },
  {
    No: "15",
    label: "Лист нержавеющий 2.0х1000х2000 AISI 304 2B матовый ASTM A480/A480M",
    size: "2.0х1000х2000",
    quantity: "0.031",
  },
  {
    No: "16",
    label: "Лист нержавеющий 2.0х1250х500 AISI 304 2B матовый ASTM A480/A480M",
    size: "2.0х1250х500",
    quantity: "0.04",
  },
  {
    No: "17",
    label: "Лист нержавеющий 2.0х1250х2500 AISI 321 2B матовый ASTM A480/A480M",
    size: "2.0х1250х2500 ",
    quantity: "3.668",
  },
  {
    No: "18",
    label: "Лист нержавеющий 3.0х1000х1000 12Х18Н10Т М2Б-М5Б ГОСТ 5582-75",
    size: "3.0х1000х1000",
    quantity: "0.02445",
  },
  {
    No: "19",
    label: "Лист нержавеющий 3,0х1000х1380 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "3,0х1000х1380",
    quantity: "0.03348",
  },
  {
    No: "20",
    label: "Лист нержавеющий 3.0х1250х490 12Х18Н10Т М2Б-М5Б ГОСТ 5582-75",
    size: "3.0х1250х490",
    quantity: "0.0093",
  },
  {
    No: "21",
    label: "Лист нержавеющий 3.0х1500х6000 AISI 321 №1 ASTM A240/A240M",
    size: "3.0х1500х6000",
    quantity: "3.808",
  },
  {
    No: "22",
    label:
      "Лист нержавеющий 4.0х1000х1490 (отрезали 670х220) 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: "4.0х1000х1490",
    quantity: "0.04186",
  },
  {
    No: "23",
    label: "Лист нержавеющий 4.0х1500х6000 AISI 316L 2B",
    size: "4.0х1500х6000",
    quantity: "1.154",
  },
  {
    No: "24",
    label:
      "Лист нержавеющий 5.0х590х1500 (отрезали 250х160) 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: "5.0х590х1500",
    quantity: "0.03424",
  },
  {
    No: "25",
    label: "Лист нержавеющий 5.0х725х970 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: "5.0х725х970",
    quantity: "0.028",
  },
  {
    No: "26",
    label: "Лист нержавеющий РФ 5х1000х1000 12Х18Н10Т М2Б-М5Б",
    size: "5х1000х1000",
    quantity: "0.03655",
  },
  {
    No: "27",
    label: "Лист нержавеющий 5.0х1500х6000 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: "5.0х1500х6000 ",
    quantity: "0.711",
  },
  {
    No: "28",
    label: "Лист нержавеющий 6.0х490х2000 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: "6.0х490х2000",
    quantity: "0.0315",
  },
  {
    No: "29",
    label: "Лист нержавеющий 6.0х1000х2000 AISI 304 №1 ASTM A240/A240M",
    size: "6.0х1000х2000",
    quantity: "0.65",
  },
  {
    No: "30",
    label:
      "Лист нержавеющий 6.0х1500х1500 (отрезали 500х1000; 800х310) 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: "6.0х1500х1500 (отрезали 500х1000; 800х310)",
    quantity: "0.06757",
  },
  {
    No: "31",
    label:
      "Лист нержавеющий 8.0х500х1500 (отрезали 360х180; 250х620) 12Х18Н10Т М2Б-М5Б ГОСТ 7350-77",
    size: " 8.0х500х1500 (отрезали 360х180; 250х620)",
    quantity: "0.02849",
  },
  {
    No: "32",
    label: "Лист нержавеющий РФ 8х1000х500 12Х18Н10Т М2Б-М5Б",
    size: "8х1000х500",
    quantity: "0.06224",
  },
  {
    No: "33",
    label: "Лист нержавеющий РФ 10х500х1000 12Х18Н10Т М2Б-М5Б",
    size: "10х500х1000",
    quantity: "0.0331",
  },
  {
    No: "34",
    label: "Лист нержавеющий 10.0х1500х6000 AISI 316L 1D",
    size: "10.0х1500х6000",
    quantity: "0.704",
  },
  {
    No: "35",
    label: "Лист нержавеющий 12,0х500х1000 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "12,0х500х1000",
    quantity: "0.0398",
  },
  {
    No: "36",
    label: "Лист нержавеющий 12.0х1500х6000 AISI 304 №1 ASTM A240/A240M",
    size: "12.0х1500х6000 ",
    quantity: "0.872",
  },
  {
    No: "37",
    label: "Лист нержавеющий 12.0х1500х6000 AISI 316L №1 ASTM A240/A240M",
    size: "12.0х1500х6000",
    quantity: "1.758",
  },
  {
    No: "38",
    label: "Лист нержавеющий РФ 16х1000х500 12Х18Н10Т М2Б-М5Б",
    size: "16х1000х500",
    quantity: "0.06124",
  },
  {
    No: "39",
    label: "Лист нержавеющий РФ 20х1000х500 12Х18Н10Т М2Б-М5Б",
    size: "20х1000х500 ",
    quantity: "0.07855",
  },
  {
    No: "40",
    label: "Лист нержавеющий 22.0х1500х6000 AISI 321 №1 ASTM A240/A240M",
    size: "22.0х1500х6000",
    quantity: "1.607",
  },
  {
    No: "41",
    label: "Лист нержавеющий 25.0х1500х6000 AISI 316L 1D",
    size: "25.0х1500х6000",
    quantity: "5.442",
  },
  {
    No: "42",
    label: "Лист нержавеющий 30,0х250х1500 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "30,0х250х1500",
    quantity: "0.0889",
  },
  {
    No: "43",
    label: "Лист нержавеющий 30,0х850х1260 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "30,0х850х1260",
    quantity: "0.105",
  },
  {
    No: "44",
    label: "Лист нержавеющий 30,0х1000х1250 12Х18Н10Т М2А-М4А ГОСТ 5582-75",
    size: "30х1000х1250",
    quantity: "0.5561",
  },
  {
    No: "45",
    label: "Лист нержавеющий 30.0х1500х6000 AISI 316L 1D",
    size: "30.0х1500х6000",
    quantity: "2.182",
  },
];

const ListsContent = () => {
  return (
    <section className="max-w-[700px] xl:max-w-[800px] flex flex-col">
      <Image src={stailessMetal} alt="нержавеющие листы" />
      <h2 className="font-medium text-gray-bg text-2xl my-2">
        Вск нержавеющие листы, которые есть на скаладе
      </h2>
      <hr className="w-full border-2 border-orange-bg rounded-lg mt-2 mb-4" />
      <div className="rounded-t-lg w-full flex justify-between bg-orange-bg text-white sticky top-[90px] xl:top-[160px]">
        <div className="text-sm md:text-md w-[30px] flex justify-center items-center text-center py-2">
          <p>№ п/п</p>
        </div>
        <div className="text-sm md:text-md w-[200px] md:w-[300px] text-center flex justify-center items-center py-2 px-1">
          <p>Наименование</p>
        </div>
        <div className="text-sm md:text-md py-2 px-1 w-[70px] md:w-[100px] xl:w-[235px] text-center flex justify-center items-center">
          <p>Размер</p>
        </div>
        <div className="text-sm md:text-md py-2 px-1 w-[70px] md:w-[100px] xl:w-[235px] text-center flex justify-center items-center">
          <p>Кол-во в 1С, т</p>
        </div>
      </div>
      <div className="w-full">
        <Products productsItems={productsItems} />
      </div>
    </section>
  );
};

export default ListsContent;
